sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/core_modules/rwip/src/rwip.c
/**
****************************************************************************************
*
* @file rwip.c
*
* @brief RW IP SW main module
*
* Copyright (C) RivieraWaves 2009-2014
* Copyright (C) 2017-2022 Modified by Renesas Electronics Corporation and/or its affiliates.
*
****************************************************************************************
*/

/**
 ****************************************************************************************
 * @addtogroup RW IP SW main module
 * @ingroup ROOT
 * @brief The RW IP SW main module.
 *
 * @{
 ****************************************************************************************
 */

/*
 * INCLUDE FILES
 ****************************************************************************************
 */

#include "rwip_config.h"    // RW SW configuration

#include <string.h>         // for mem* functions
#include "co_version.h"
#include "rwip.h"           // RW definitions
#include "arch.h"           // Platform architecture definition
#include "arch_api.h"


#if (BLE_EMB_PRESENT)
    #include "rwble.h"          // rwble definitions
#endif //BLE_EMB_PRESENT

#if (BLE_HOST_PRESENT)
    #include "rwble_hl.h"       // BLE HL definitions
    #include "gapc.h"
    #include "smpc.h"
    #include "gattc.h"
    #include "attc.h"
    #include "atts.h"
    #include "l2cc.h"
#endif //BLE_HOST_PRESENT

#if (BLE_APP_PRESENT)
    #include "app.h"            // Application definitions
#endif //BLE_APP_PRESENT

#include "syscntl.h"
#include "lld_sleep.h"      // definitions for sleep mode
#include "llc.h"

#include "plf.h"            // platform definition
#include "rf.h"             // RF definitions

#if (GTL_ITF)
    #include "gtl.h"
    #include "gtl_eif.h"
#endif //GTL_ITF

#include "h4tl.h"

#if (KE_SUPPORT)
    #include "ke.h"             // kernel definition
    #include "ke_event.h"       // kernel event
    #include "ke_timer.h"       // definitions for timer
    #include "ke_mem.h"         // kernel memory manager
    #include "ke_env.h"
#endif //KE_SUPPORT

#include "dbg.h"            // debug definition

#if ((BLE_APP_PRESENT) || ((BLE_HOST_PRESENT && (!GTL_ITF))))
    #include "app.h"
#endif //BLE_APP_PRESENT

#include "em_map_ble.h"
#include "arch_system.h"

#if defined (__DA14531__)
#include "otp_cs.h"
#endif

uint32_t sleep_lp_cycles __SECTION_ZERO("retention_mem_area0");
uint32_t slp_period_retained __SECTION_ZERO("retention_mem_area0"); // sleep counter value at wakeup

#if defined (__DA14531__)
extern uint16_t xtal_wait_trim;
extern uint32_t twirq_set_value;
extern uint32_t twirq_reset_value;
uint32_t twext_value;
#endif

/*
 * GLOBAL VARIABLES DECLARATION
 ****************************************************************************************
 */
extern boost_overhead_st set_boost_low_vbat1v_overhead;
extern rcx_time_data_t rcx_time_data;
extern struct arch_sleep_env_tag sleep_env;

uint32_t retained_BLE_EM_BASE_REG __SECTION_ZERO("retention_mem_area0");

#if (USE_XTAL16M_ADAPTIVE_SETTLING && USE_POWER_OPTIMIZATIONS)
    extern uint32_t twirq_set;
    extern uint32_t twirq_set_min;
    extern uint32_t twirq_set_max;
#endif

/*
 * PROFILING CODE
 ****************************************************************************************
 */
#if defined(DEBUG_RWIP_SLEEP)

    uint32_t dbg_rwip_sleep_step __SECTION_ZERO("retention_mem_area0");

    #define DEBUG_RWIP_SLEEP_STEP(step) \
        do {                            \
            dbg_rwip_sleep_step = step; \
        } while(0)
#else

    #define DEBUG_RWIP_SLEEP_STEP(step)

#endif // defined(DEBUG_RWIP_SLEEP)

#if (defined (__DA14531_01__) || defined (__DA14535__)) && !defined (__EXCLUDE_ROM_RWIP__)
typedef uint8_t (*check_sys_startup_period_t)(void);
uint32_t rwip_sleep_step;
extern uint8_t check_sys_startup_period(void);
extern bool rwip_sleep_part1_ROM(uint32_t *rwip_sleep_step, sleep_mode_t *ptr_proc_sleep, check_sys_startup_period_t func);
extern bool rwip_sleep_part2_ROM(uint32_t *rwip_sleep_step, uint32_t *sleep_duration);
extern bool rwip_sleep_part3_ROM(uint32_t *sleep_duration);
#endif // __EXCLUDE_ROM_RWIP__

/*
 * LOCAL FUNCTIONS DEFINITIONS
 ****************************************************************************************
 */
static uint32_t rwip_slot_2_lpcycles(uint32_t slot_cnt)
{
    uint32_t lpcycles;

    // Sanity check: The number of slots should not be too high to avoid overflow
    ASSERT_ERROR(slot_cnt < 1000000);

#ifdef XTAL_32000HZ
    // Compute the low power clock cycles - case of a 32kHz clock
    lpcycles = slot_cnt * 20;
#else
    // Compute the low power clock cycles - case of a 32.768kHz clock
    lpcycles = (slot_cnt << 11)/100;
#endif

    if(lpcycles)
    {
       lpcycles--;
    }

    return(lpcycles);
}


static uint32_t rwip_slot_2_lpcycles_rcx(uint32_t slot_cnt)
{
    uint32_t lpcycles;

    // Sanity check: The number of slots should not be too high to avoid overflow
    ASSERT_ERROR(slot_cnt < 1000000);

    lpcycles = (uint32_t) ((slot_cnt * rcx_time_data.rcx_slot_duration) >> 20);

    return lpcycles;
}

static uint32_t get_max_sleep_duration(void)
{
    uint32_t max_sleep_duration;

    if(BLE_APP_PRESENT)
    {
        if(BLE_INTEGRATED_HOST_GTL)
        {
            // Single processor application with external interface (GTL or HCI)
            max_sleep_duration = rom_cfg_table[max_sleep_duration_periodic_wakeup_pos];
        }
        else
        {
            // Single processor application
            max_sleep_duration = rom_cfg_table[max_sleep_duration_external_wakeup_pos];
        }
    }
    else
    {
        if (EXTERNAL_WAKEUP || UART_FLOW_CTRL_WAKEUP)
        {
            // External processor configuration with EXTERNAL_WAKEUP support
            max_sleep_duration = rom_cfg_table[max_sleep_duration_external_wakeup_pos];
        }
        else
        {
            // External processor configuration
            max_sleep_duration = rom_cfg_table[max_sleep_duration_periodic_wakeup_pos];
        }
    }

    return max_sleep_duration;
}

