sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/core_modules/rwip/src/rwip.c
/*
 * EXPORTED FUNCTION DEFINITIONS
 ****************************************************************************************
 */

void patched_ble_regs_push(void)
{
    // ROM function declaration
    void ble_regs_push(void);

    ble_regs_push();
    retained_BLE_EM_BASE_REG = GetWord32(BLE_EM_BASE_REG);
}

void patched_ble_regs_pop(void)
{
    // ROM function declaration
    void ble_regs_pop(void);

    ble_regs_pop();
    SetWord32(BLE_EM_BASE_REG, retained_BLE_EM_BASE_REG);
}

sleep_mode_t rwip_sleep(void)
{
    sleep_mode_t proc_sleep = mode_active;
#if !defined (__DA14531__)
    uint32_t twirq_set_value;
    uint32_t twirq_reset_value;
    uint32_t twext_value;
#endif

    uint32_t sleep_duration = get_max_sleep_duration();

#if (USE_POWER_OPTIMIZATIONS)
    // We may lower the clock now while we are waiting the BLE to go to sleep...
    bool slow_system_clk = false;
#endif

#if (!USE_XTAL16M_ADAPTIVE_SETTLING)
    #if (!DEVELOPMENT_DEBUG)
        uint32_t sleep_lp_cycles;
    #endif
#endif

    if (BLE_APP_PRESENT)
    {
        if ( arch_ble_ext_wakeup_get() || (rwip_env.ext_wakeup_enable == 2) )  // sleep forever!
            sleep_duration = 0;
    }
    else if (!EXTERNAL_WAKEUP || !UART_FLOW_CTRL_WAKEUP) // sleep_duration will remain as it was set above....
    {
        if (rwip_env.ext_wakeup_enable == 2)
            sleep_duration = 0;
    }

    do
    {
#if (defined (__DA14531_01__) || defined (__DA14535__)) && !defined (__EXCLUDE_ROM_RWIP__)
        if (rwip_sleep_part1_ROM(&rwip_sleep_step, &proc_sleep, check_sys_startup_period))
        {
            break;
        }
#else
        /************************************************************************
         **************            CHECK BLE WAKEUP REQ            **************
         ************************************************************************/
        if (GetBits16(GP_CONTROL_REG, BLE_WAKEUP_REQ))
        {
            break;
        }

        /************************************************************************
         **************            CHECK STARTUP FLAG             **************
         ************************************************************************/

        DEBUG_RWIP_SLEEP_STEP(0);

        // Do not allow sleep if system is in startup period
        // (only applicable if XTAL32K is the LP clock)
        if (arch_clk_is_XTAL32())
        {
            if (check_sys_startup_period())
            {
                break;
            }
        }

        DEBUG_RWIP_SLEEP_STEP(1);

        /************************************************************************
         **************            CHECK KERNEL EVENTS             **************
         ************************************************************************/
        // Check if some kernel processing is ongoing
        if (!ke_sleep_check())
            break;

        DEBUG_RWIP_SLEEP_STEP(2);

        // Processor sleep can be enabled
        proc_sleep = mode_idle;

        /************************************************************************
         **************             CHECK ENABLE FLAG              **************
         ************************************************************************/
        // Check sleep enable flag
        if(!rwip_env.sleep_enable)
            break;

        DEBUG_RWIP_SLEEP_STEP(3);

        /************************************************************************
         **************           CHECK RADIO POWER DOWN           **************
         ************************************************************************/
        // Check if BLE + Radio are still sleeping
        if(GetBits16(SYS_STAT_REG, RAD_IS_DOWN)) {
            // If BLE + Radio are in sleep return the appropriate mode for ARM
            proc_sleep = mode_sleeping;
            break;
        }

        DEBUG_RWIP_SLEEP_STEP(4);

        /************************************************************************
         **************              CHECK RW FLAGS                **************
         ************************************************************************/
        // First check if no pending procedure prevents us from going to sleep
        if (rwip_prevent_sleep_get() != 0)
            break;

        DEBUG_RWIP_SLEEP_STEP(5);
#endif // __EXCLUDE_ROM_RWIP__

        /************************************************************************
         *                                                                      *
         *                   CHECK DURATION UNTIL NEXT EVENT                    *
         *                                                                      *
         ************************************************************************/
        // If there's any timer pending, compute the time to wake-up to serve it
        if ((!arch_ble_ext_wakeup_get()) && (ke_env.queue_timer.first != NULL))
        {
            sleep_duration = get_max_sleep_duration();
        }

#if (USE_XTAL16M_ADAPTIVE_SETTLING && USE_POWER_OPTIMIZATIONS)
        set_sleep_delay();
#endif

#if defined (__DA14531__)
        set_sleep_delay();
#endif

#if (defined (__DA14531_01__) || defined (__DA14535__)) && !defined (__EXCLUDE_ROM_RWIP__)
    if (rwip_sleep_part2_ROM(&rwip_sleep_step, &sleep_duration))
    {
        break;
    }
#else
        /************************************************************************
         **************            CHECK KERNEL TIMERS             **************
         ************************************************************************/
        // Compute the duration up to the next software timer expires
        if (!ke_timer_sleep_check(&sleep_duration, rwip_env.wakeup_delay))
            break;

        DEBUG_RWIP_SLEEP_STEP(6);

        // Check if a kernel timer has expired before the above ke_timer_sleep_check()
        // function call. If that happens the ke_timer_sleep_check() will incorrectly
        // allow the system to enter sleep, because the timeout of the first timer is
        // already in the past, and consequently the timer event will not be serviced
        // until the next system wake up (the rwip_sleep() function is being called
        // while the interrupts are disabled).
        if ((ble_intstat_get() & BLE_GROSSTGTIMINTSTAT_BIT))
        {
            break;
        }

        DEBUG_RWIP_SLEEP_STEP(7);

        /************************************************************************
         **************                 CHECK EA                   **************
         ************************************************************************/
        if (!ea_sleep_check(&sleep_duration, rwip_env.wakeup_delay))
                break;

        DEBUG_RWIP_SLEEP_STEP(8);
#endif // __EXCLUDE_ROM_RWIP__

