sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/core_modules/rwip/src/rwip.c
        #if (TL_ITF)
        /************************************************************************
         **************                 CHECK TL                   **************
         ************************************************************************/
        if((BLE_APP_PRESENT == 0) || (BLE_INTEGRATED_HOST_GTL == 1 ))
        {
            // Try to switch off TL
            if (!h4tl_stop())
            {
                proc_sleep = mode_active;
                break;
            }
        }
        #endif //TL_ITF

        DEBUG_RWIP_SLEEP_STEP(9);

        #if (GTL_ITF)
        /************************************************************************
         **************                 CHECK TL                   **************
         ************************************************************************/
        if((BLE_APP_PRESENT == 0) || (BLE_INTEGRATED_HOST_GTL == 1 ))
        {
            // Try to switch off Transport Layer
            if (!gtl_enter_sleep())
            {
                proc_sleep = mode_active;
                break;
            }
        }
        #endif //GTL_ITF

        DEBUG_RWIP_SLEEP_STEP(10);


        if(USE_POWER_OPTIMIZATIONS && ((BLE_APP_PRESENT == 0) || (BLE_INTEGRATED_HOST_GTL == 1 )))
        {
#if (defined (__DA14531_01__) || defined (__DA14535__)) && !defined (__EXCLUDE_ROM_RWIP__)
            if (rwip_sleep_part3_ROM(&sleep_duration))
            {
                break;
            }
#else
            bool sleep_check = false;

            do
            {
                /************************************************************************
                 **************            CHECK KERNEL TIMERS             **************
                 ************************************************************************/
                // Compute the duration up to the next software timer expires
                if (!ke_timer_sleep_check(&sleep_duration, rwip_env.wakeup_delay))
                    break;
                if ((ble_intstat_get() & BLE_GROSSTGTIMINTSTAT_BIT))
                {
                    break;
                }

                /************************************************************************
                 **************                 CHECK EA                   **************
                 ************************************************************************/
                if (!ea_sleep_check(&sleep_duration, rwip_env.wakeup_delay))
                        break;

                sleep_check = true;

            } while(0);

            if (!sleep_check)
            {
                extern char use_h4tl; // ROM variable
                if(use_h4tl & 0x01)
                {
                    h4tl_init(rwip_eif_get(RWIP_EIF_HCIC));
                }
                else
                {
                    gtl_eif_init();
                }

                // sleep is aborted and serial i/f communication is restored
                break;
            }
#endif // __EXCLUDE_ROM_RWIP__
        }

#if defined (__DA14531__)
        syscntl_cfg_xtal32m_amp_reg(XTAL32M_AMP_REG_TRACKING);      // switch to TRACKING mode when going to sleep
#endif

        if (USE_POWER_OPTIMIZATIONS)
        {
            if ( arch_clk_is_RCX20() )
            {
                // The XTAL16M adaptive settling cannot be used with RCX
                ASSERT_WARNING(!USE_XTAL16M_ADAPTIVE_SETTLING)

                if (sleep_duration)
                {
                    uint32_t finecnt = ble_finetimecnt_get();

                    // If we are close before the half of this slot then the actual sleep entry will
                    // occur during the next one. But the sleep_duration will have been calculated
                    // based on the current slot...
                    if (finecnt <= (530) && finecnt >= (624/2))
                        sleep_duration--;
                }
            }
        }

#if defined (__DA14531__)
        /************************************************************************
         **************          PROGRAM CORE DEEP SLEEP           **************
         ************************************************************************/

        // TWSET and TWRESET values are calculated in set_sleep_delay()

        // TWEXT setting
        twext_value = xtal_wait_trim + twirq_reset_value;
#else
        /************************************************************************
         **************          PROGRAM CORE DEEP SLEEP           **************
         ************************************************************************/
        if ( arch_clk_is_RCX20() )
        {
            // Boost mode + RCX is not supported in DA14585/586
            if (GetBits16(ANA_STATUS_REG, BOOST_SELECTED) == 1)
                 ASSERT_WARNING(0);

            #if (!USE_POWER_OPTIMIZATIONS)
                twirq_set_value = lld_sleep_us_2_lpcycles_sel_func(XTAL_TRIMMING_TIME_USEC);
                twirq_reset_value = TWIRQ_RESET_VALUE;

                // TWEXT setting
                twext_value = TWEXT_VALUE_RCX;
            #else
                // Calculate the time we need to wake-up before "time 0" to do XTAL16 settling,
                // call periph_init() and power-up the BLE core.
                uint32_t lpcycles = lld_sleep_us_2_lpcycles_sel_func(LP_ISR_TIME_USEC + XTAL_HIGH_TEMP_LATENCY_STARTUP_USEC);

                // Set TWIRQ_SET taking into account that some LP cycles are needed for the power up FSM.
                twirq_set_value = RCX_POWER_UP_TIME + lpcycles;
                if (sleep_env.slp_state == ARCH_EXT_SLEEP_OTP_COPY_ON)
                    twirq_set_value += RCX_OTP_COPY_OVERHEAD;

                // Program LP deassertion to occur when the XTAL16M has settled
                uint32_t xtal_settling_cycles = lld_sleep_us_2_lpcycles_sel_func(XTAL16M_SETTLING_IN_USEC + XTAL_HIGH_TEMP_LATENCY_STARTUP_USEC);
                twirq_reset_value = lpcycles - xtal_settling_cycles;

                // TWEXT setting
                twext_value = lpcycles;
            #endif
        }
        else if ( arch_clk_is_XTAL32( ) )
        {
            #if (!USE_POWER_OPTIMIZATIONS)
                twirq_set_value = XTAL_TRIMMING_TIME;
                twirq_reset_value = TWIRQ_RESET_VALUE;
                twext_value = TWEXT_VALUE_XTAL32;
            #else
                // The time we need to wake-up before "time 0" to do XTAL16 settling,
                // call periph_init() and power-up the BLE core is LP_ISR_TIME_XTAL32_CYCLES in this case.

                #if (USE_XTAL16M_ADAPTIVE_SETTLING)
                    twirq_set_value = twirq_set;
                #else
                    // Set TWIRQ_SET taking into account that some LP cycles are needed for the power up FSM.
                    twirq_set_value = XTAL32_POWER_UP_TIME + LP_ISR_TIME_XTAL32_CYCLES + XTAL_HIGH_TEMP_LATENCY_STARTUP_XTAL32_CYCLES;
                #endif

                if (sleep_env.slp_state == ARCH_EXT_SLEEP_OTP_COPY_ON)
                    twirq_set_value += XTAL32_OTP_COPY_OVERHEAD;

                // Adjust TWIRQ_SET in case of BOOST mode, if needed
                if (set_boost_low_vbat1v_overhead == APPLY_OVERHEAD)
                    twirq_set_value += BOOST_POWER_UP_OVERHEAD;
                set_boost_low_vbat1v_overhead = NOT_MEASURED;

                #if (USE_XTAL16M_ADAPTIVE_SETTLING)
                    twirq_reset_value = TWIRQRESET_XTAL32_TICKS;
                #else
                    // Program LP deassertion to occur when the XTAL16M has settled
                    twirq_reset_value = LP_ISR_TIME_XTAL32_CYCLES + XTAL_HIGH_TEMP_LATENCY_STARTUP_XTAL32_CYCLES - XTAL16M_SETTLING_IN_XTAL32_CYCLES;
                #endif

                // TWEXT setting
                twext_value = LP_ISR_TIME_XTAL32_CYCLES + XTAL_HIGH_TEMP_LATENCY_STARTUP_XTAL32_CYCLES;
            #endif
        }
#endif // __DA14531__

