sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/core_modules/rwip/src/rwip.c
        //Prepare BLE_ENBPRESET_REG for next sleep cycle
        SetBits32(BLE_ENBPRESET_REG, TWIRQ_RESET, twirq_reset_value);   // TWIRQ_RESET
        SetBits32(BLE_ENBPRESET_REG, TWIRQ_SET, twirq_set_value);       // TWIRQ_SET
        SetBits32(BLE_ENBPRESET_REG, TWEXT, twext_value);               // TWEXT

        //Everything ready for sleep!
        proc_sleep = mode_sleeping;

        // Put BT core into deep sleep
        if ( arch_clk_is_XTAL32( ) )
            sleep_lp_cycles = rwip_slot_2_lpcycles(sleep_duration);
        else if ( arch_clk_is_RCX20() )
            sleep_lp_cycles = rwip_slot_2_lpcycles_rcx(sleep_duration);

        // Apply correction to sleep_lp_cycles in order to handle the additional
        // microseconds that may be added to the total sleep duration for clock
        // compensation due to ble_finetim_corr. This prevents getting more whole
        // slots for compensation than the ones requested in sleep_duration.
        if ( arch_clk_is_XTAL32() )
            sleep_lp_cycles -= 3;
        else if ( arch_clk_is_RCX20() )
            sleep_lp_cycles -= 1;

        // Apply correction for boundary condition
        if (sleep_lp_cycles == twirq_set_value + 1)
        {
           sleep_lp_cycles =  twirq_set_value;
        }

        lld_sleep_enter(sleep_lp_cycles, rwip_env.ext_wakeup_enable);

        /************************************************************************
         **************               SWITCH OFF RF                **************
         ************************************************************************/

        /* >>> Start of BLE deep sleep entry delay measurement <<< */

        rwip_rf.sleep();

        #if (USE_POWER_OPTIMIZATIONS)
            if (BLE_APP_PRESENT)
            {
                if ( app_use_lower_clocks_check() )
                {
                    // It will save some power if you lower the clock while waiting for STAT...
                    syscntl_use_lowest_amba_clocks();
                    slow_system_clk = true;
                }
            }
        #endif

        while(!ble_deep_sleep_stat_getf());

        /* >>> End of BLE deep sleep entry delay measurement <<< */

        //check and wait till you may disable the radio. 32.768KHz XTAL must be running!
        //(debug note: use BLE_CNTL2_REG:MON_LP_CLK bit to check (write 0, should be set to 1 by the BLE))
        while ( !(GetWord32(BLE_CNTL2_REG) & RADIO_PWRDN_ALLOW) ) {}

        SetBits32(BLE_CNTL2_REG, MON_LP_CLK, 0);              // Clear LP edge flag

        #if (USE_POWER_OPTIMIZATIONS)
            if (slow_system_clk)
            {
                // and restore clock rates (refer to a couple of lines above)
                syscntl_use_highest_amba_clocks();
            }
        #endif

        /* The time needed from SLP assertion until the completion of the clock
         * compensation is 54usec for single processor applications and 66usec
         * for external processor applications. The threshold is set to 70usec.
         */
        {
            const uint32_t ISR_DELAY = 70;
            extern uint32_t ble_finetim_corr;
            uint16_t rem_time;
#if defined (__DA14531__)
            rem_time = GetWord16(BLE_TIMER_REG);
#else
            rem_time = GetWord16(BLE_FINECNT_SAMP_REG);
#endif
            if (rem_time < ISR_DELAY)
            {
                ble_finetim_corr = ISR_DELAY - rem_time;
#if defined (__DA14531__)
                SetWord16(BLE_TIMER_REG, ISR_DELAY);
#else
                SetWord16(BLE_FINECNT_SAMP_REG, ISR_DELAY);
#endif
            }
        }

        patched_ble_regs_push(); // save BLE registers to retained memory

        while ( !(GetWord32(BLE_CNTL2_REG) & MON_LP_CLK) ) {}    // Wait for LP rising edge

        //BLE CLK must be turned off when DEEP_SLEEP_STAT is set
        SetBits16(CLK_RADIO_REG, BLE_ENABLE, 0);

    } while(0);

    return proc_sleep;
}
